-- MySQL dump 10.13  Distrib 8.0.18, for Win64 (x86_64)
--
-- Host: localhost    Database: mall
-- ------------------------------------------------------
-- Server version	8.0.18

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `mall`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `mall` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;

USE `mall`;

--
-- Table structure for table `tb_mall_admin_user`
--

DROP TABLE IF EXISTS `tb_mall_admin_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_admin_user` (
  `admin_user_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '管理员id',
  `login_username` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员登陆名称',
  `login_password` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员登陆密码',
  `nick_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '管理员显示昵称',
  `locked` tinyint(4) DEFAULT '0' COMMENT '是否锁定 0未锁定 1已锁定无法登陆',
  PRIMARY KEY (`admin_user_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_admin_user`
--

LOCK TABLES `tb_mall_admin_user` WRITE;
/*!40000 ALTER TABLE `tb_mall_admin_user` DISABLE KEYS */;
INSERT INTO `tb_mall_admin_user` VALUES (1,'admin','670b14728ad9902aecba32e22fa4f6bd','guest',0);
/*!40000 ALTER TABLE `tb_mall_admin_user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_carousel`
--

DROP TABLE IF EXISTS `tb_mall_carousel`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_carousel` (
  `carousel_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '首页轮播图主键id',
  `carousel_url` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '轮播图',
  `redirect_url` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '''##''' COMMENT '点击后的跳转地址(默认不跳转)',
  `carousel_rank` int(11) NOT NULL DEFAULT '0' COMMENT '排序值(字段越大越靠前)',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `create_user` int(11) NOT NULL DEFAULT '0' COMMENT '创建者id',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '修改时间',
  `update_user` int(11) NOT NULL DEFAULT '0' COMMENT '修改者id',
  PRIMARY KEY (`carousel_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_carousel`
--

LOCK TABLES `tb_mall_carousel` WRITE;
/*!40000 ALTER TABLE `tb_mall_carousel` DISABLE KEYS */;
/*!40000 ALTER TABLE `tb_mall_carousel` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_goods_category`
--

DROP TABLE IF EXISTS `tb_mall_goods_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_goods_category` (
  `category_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '分类id',
  `category_level` tinyint(4) NOT NULL DEFAULT '0' COMMENT '分类级别(1-一级分类 2-二级分类 3-三级分类)',
  `parent_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '父分类id',
  `category_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '分类名称',
  `category_rank` int(11) NOT NULL DEFAULT '0' COMMENT '排序值(字段越大越靠前)',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `create_user` int(11) NOT NULL DEFAULT '0' COMMENT '创建者id',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '修改时间',
  `update_user` int(11) DEFAULT '0' COMMENT '修改者id',
  PRIMARY KEY (`category_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=108 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_goods_category`
--

LOCK TABLES `tb_mall_goods_category` WRITE;
/*!40000 ALTER TABLE `tb_mall_goods_category` DISABLE KEYS */;
INSERT INTO `tb_mall_goods_category` VALUES (15,1,0,'家电 数码 3C',2,0,'2019-09-11 18:45:40',0,'2020-03-25 15:36:55',0),(16,1,0,'女装 男装 运动装',88,0,'2019-09-11 18:46:07',0,'2020-03-25 14:59:48',0),(17,2,15,'家电',10,0,'2019-09-11 18:46:32',0,'2019-09-11 18:46:32',0),(18,2,15,'数码',9,0,'2019-09-11 18:46:43',0,'2019-09-11 18:46:43',0),(19,2,15,'手机',8,0,'2019-09-11 18:46:52',0,'2019-09-11 18:46:52',0),(20,3,17,'生活电器',0,0,'2019-09-11 18:47:38',0,'2019-09-11 18:47:38',0),(21,3,17,'厨房电器',0,0,'2019-09-11 18:47:49',0,'2019-09-11 18:47:49',0),(22,3,17,'扫地机器人',0,0,'2019-09-11 18:47:58',0,'2019-09-11 18:47:58',0),(23,3,17,'吸尘器',0,0,'2019-09-11 18:48:06',0,'2019-09-11 18:48:06',0),(24,3,17,'取暖器',0,0,'2019-09-11 18:48:12',0,'2019-09-11 18:48:12',0),(25,3,17,'豆浆机',0,0,'2019-09-11 18:48:26',0,'2019-09-11 18:48:26',0),(26,3,17,'暖风机',0,0,'2019-09-11 18:48:40',0,'2019-09-11 18:48:40',0),(27,3,17,'加湿器',0,0,'2019-09-11 18:48:50',0,'2019-09-11 18:48:50',0),(28,3,17,'蓝牙音箱',0,0,'2019-09-11 18:48:57',0,'2019-09-11 18:48:57',0),(29,3,17,'烤箱',0,0,'2019-09-11 18:49:09',0,'2019-09-11 18:49:09',0),(30,3,17,'卷发器',0,0,'2019-09-11 18:49:19',0,'2019-09-11 18:49:19',0),(31,3,17,'空气净化器',0,0,'2019-09-11 18:49:30',0,'2019-09-11 18:49:30',0),(32,3,18,'游戏主机',0,0,'2019-09-11 18:49:50',0,'2019-09-11 18:49:50',0),(33,3,18,'数码精选',0,0,'2019-09-11 18:49:55',0,'2019-09-11 18:49:55',0),(34,3,18,'平板电脑',0,0,'2019-09-11 18:50:08',0,'2019-09-11 18:50:08',0),(35,3,18,'苹果 Apple',0,0,'2019-09-11 18:50:24',0,'2019-09-11 18:50:24',0),(36,3,18,'电脑主机',0,0,'2019-09-11 18:50:36',0,'2019-09-11 18:50:36',0),(37,3,18,'数码相机',0,0,'2019-09-11 18:50:57',0,'2019-09-11 18:50:57',0),(38,3,18,'电玩动漫',0,0,'2019-09-11 18:52:15',0,'2019-09-11 18:52:15',0),(39,3,18,'单反相机',0,0,'2019-09-11 18:52:26',0,'2019-09-11 18:52:26',0),(40,3,18,'键盘鼠标',0,0,'2019-09-11 18:52:46',0,'2019-09-11 18:52:46',0),(41,3,18,'无人机',0,0,'2019-09-11 18:53:01',0,'2019-09-11 18:53:01',0),(42,3,18,'二手电脑',0,0,'2019-09-11 18:53:08',0,'2019-09-11 18:53:08',0),(43,3,18,'二手手机',0,0,'2019-09-11 18:53:14',0,'2019-09-11 18:53:14',0),(44,3,19,'iPhone 11',89,0,'2019-09-11 18:53:49',0,'2019-09-11 18:54:38',0),(45,3,19,'荣耀手机',99,0,'2019-09-11 18:53:59',0,'2019-09-18 13:40:59',0),(46,3,19,'华为手机',98,0,'2019-09-11 18:54:20',0,'2019-09-18 13:40:51',0),(47,3,19,'iPhone',88,0,'2019-09-11 18:54:49',0,'2019-09-18 13:40:32',0),(48,3,19,'华为 Mate 20',79,0,'2019-09-11 18:55:03',0,'2019-09-11 18:55:13',0),(49,3,19,'华为 P30',97,0,'2019-09-11 18:55:22',0,'2019-09-11 18:55:22',0),(50,3,19,'华为 P30 Pro',0,1,'2019-09-11 18:55:32',0,'2019-09-11 18:55:32',0),(51,3,19,'小米手机',0,0,'2019-09-11 18:55:52',0,'2019-09-11 18:55:52',0),(52,3,19,'红米',0,0,'2019-09-11 18:55:58',0,'2019-09-11 18:55:58',0),(53,3,19,'OPPO',0,0,'2019-09-11 18:56:06',0,'2019-09-11 18:56:06',0),(54,3,19,'一加',0,0,'2019-09-11 18:56:12',0,'2019-09-11 18:56:12',0),(55,3,19,'小米 MIX',0,0,'2019-09-11 18:56:37',0,'2019-09-11 18:56:37',0),(56,3,19,'Reno',0,0,'2019-09-11 18:56:49',0,'2019-09-11 18:56:49',0),(57,3,19,'vivo',0,0,'2019-09-11 18:57:01',0,'2019-09-11 18:57:01',0),(58,3,19,'手机以旧换新',0,0,'2019-09-11 18:57:09',0,'2019-09-11 18:57:09',0),(59,1,0,'运动 户外 乐器',97,0,'2019-09-12 00:08:46',0,'2019-09-12 00:08:46',0),(60,1,0,'游戏 动漫 影视',96,0,'2019-09-12 00:09:00',0,'2019-09-12 00:09:00',0),(61,1,0,'家具 家饰 家纺',98,0,'2019-09-12 00:09:27',0,'2019-09-12 00:09:27',0),(62,1,0,'美妆 清洁 宠物',94,0,'2019-09-12 00:09:51',0,'2019-09-17 18:22:34',0),(63,1,0,'工具 装修 建材',93,0,'2019-09-12 00:10:07',0,'2019-09-12 00:10:07',0),(64,1,0,'珠宝 金饰 眼镜',92,0,'2019-09-12 00:10:35',0,'2019-09-12 00:16:30',0),(65,1,0,'玩具 孕产 用品',0,0,'2019-09-12 00:11:17',0,'2019-09-12 00:11:17',0),(66,1,0,'鞋靴 箱包 配件',91,0,'2019-09-12 00:11:30',0,'2019-09-12 00:11:30',0),(67,2,16,'女装',10,0,'2019-09-12 00:15:19',0,'2019-09-12 00:15:19',0),(68,2,16,'男装',9,0,'2019-09-12 00:15:28',0,'2019-09-12 00:15:28',0),(69,2,16,'穿搭',8,0,'2019-09-12 00:15:35',0,'2019-09-12 00:15:35',0),(70,2,61,'家具',10,0,'2019-09-12 00:20:22',0,'2019-09-12 00:20:22',0),(71,2,61,'家饰',9,0,'2019-09-12 00:20:29',0,'2019-09-12 00:20:29',0),(72,2,61,'家纺',8,0,'2019-09-12 00:20:35',0,'2019-09-12 00:20:35',0),(73,2,59,'运动',10,0,'2019-09-12 00:20:49',0,'2019-09-12 00:20:49',0),(74,2,59,'户外',9,0,'2019-09-12 00:20:58',0,'2019-09-12 00:20:58',0),(75,2,59,'乐器',8,0,'2019-09-12 00:21:05',0,'2019-09-12 00:21:05',0),(76,3,67,'外套',10,0,'2019-09-12 00:21:55',0,'2019-09-12 00:21:55',0),(77,3,70,'沙发',10,0,'2019-09-12 00:22:21',0,'2019-09-12 00:22:21',0),(78,3,73,'跑鞋',10,0,'2019-09-12 00:22:42',0,'2019-09-12 00:22:42',0),(79,2,60,'游戏',10,0,'2019-09-12 00:23:13',0,'2019-09-12 00:23:13',0),(80,2,60,'动漫',9,0,'2019-09-12 00:23:21',0,'2019-09-12 00:23:21',0),(81,2,60,'影视',8,0,'2019-09-12 00:23:27',0,'2019-09-12 00:23:27',0),(82,3,79,'LOL',10,0,'2019-09-12 00:23:44',0,'2019-09-12 00:23:44',0),(83,2,62,'美妆',10,0,'2019-09-12 00:23:58',0,'2019-09-17 18:22:44',0),(84,2,62,'宠物',9,0,'2019-09-12 00:24:07',0,'2019-09-12 00:24:07',0),(85,2,62,'清洁',8,0,'2019-09-12 00:24:15',0,'2019-09-17 18:22:51',0),(86,3,83,'口红',10,0,'2019-09-12 00:24:38',0,'2019-09-17 18:23:08',0),(87,2,63,'工具',10,0,'2019-09-12 00:24:56',0,'2019-09-12 00:24:56',0),(88,2,63,'装修',9,0,'2019-09-12 00:25:05',0,'2019-09-12 00:25:05',0),(89,2,63,'建材',8,0,'2019-09-12 00:25:12',0,'2019-09-12 00:25:12',0),(90,3,87,'转换器',10,0,'2019-09-12 00:25:45',0,'2019-09-12 00:25:45',0),(91,2,64,'珠宝',10,0,'2019-09-12 00:26:10',0,'2019-09-12 00:26:10',0),(92,2,64,'金饰',9,0,'2019-09-12 00:26:18',0,'2019-09-12 00:26:18',0),(93,2,64,'眼镜',8,0,'2019-09-12 00:26:25',0,'2019-09-12 00:26:25',0),(94,3,91,'钻石',10,0,'2019-09-12 00:26:40',0,'2019-09-12 00:26:40',0),(95,2,66,'鞋靴',10,0,'2019-09-12 00:27:09',0,'2019-09-12 00:27:09',0),(96,2,66,'箱包',9,0,'2019-09-12 00:27:17',0,'2019-09-12 00:27:17',0),(97,2,66,'配件',8,0,'2019-09-12 00:27:23',0,'2019-09-12 00:27:23',0),(98,3,95,'休闲鞋',10,0,'2019-09-12 00:27:48',0,'2019-09-12 00:27:48',0),(99,3,83,'气垫',0,0,'2019-09-17 18:24:23',0,'2019-09-17 18:24:23',0),(100,3,83,'美白',0,0,'2019-09-17 18:24:36',0,'2019-09-17 18:24:36',0),(101,3,83,'隔离霜',0,0,'2019-09-17 18:27:04',0,'2019-09-17 18:27:04',0),(102,3,83,'粉底',0,0,'2019-09-17 18:27:19',0,'2019-09-17 18:27:19',0),(103,3,83,'腮红',0,0,'2019-09-17 18:27:24',0,'2019-09-17 18:27:24',0),(104,3,83,'睫毛膏',0,0,'2019-09-17 18:27:47',0,'2019-09-17 18:27:47',0),(105,3,83,'香水',0,0,'2019-09-17 18:28:16',0,'2019-09-17 18:28:16',0),(106,3,83,'面膜',0,0,'2019-09-17 18:28:21',0,'2019-09-17 18:28:21',0),(107,1,0,'电脑 笔记本 台式机',4,0,'2020-03-25 15:45:27',0,'2020-03-25 15:45:27',0);
/*!40000 ALTER TABLE `tb_mall_goods_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_goods_info`
--

DROP TABLE IF EXISTS `tb_mall_goods_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_goods_info` (
  `goods_id` bigint(20) unsigned NOT NULL AUTO_INCREMENT COMMENT '商品表主键id',
  `goods_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '商品名',
  `goods_intro` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '商品简介',
  `goods_category_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '关联分类id',
  `goods_cover_img` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '/admin/dist/img/no-img.png' COMMENT '商品主图',
  `goods_carousel` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '/admin/dist/img/no-img.png' COMMENT '商品轮播图',
  `goods_detail_content` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '商品详情',
  `original_price` int(11) NOT NULL DEFAULT '1' COMMENT '商品价格',
  `selling_price` int(11) NOT NULL DEFAULT '1' COMMENT '商品实际售价',
  `stock_num` int(11) NOT NULL DEFAULT '0' COMMENT '商品库存数量',
  `tag` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '商品标签',
  `goods_sell_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '商品上架状态 0-下架 1-上架',
  `create_user` int(11) NOT NULL DEFAULT '0' COMMENT '添加者主键id',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '商品添加时间',
  `update_user` int(11) NOT NULL DEFAULT '0' COMMENT '修改者主键id',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '商品修改时间',
  PRIMARY KEY (`goods_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=10109 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_goods_info`
--

LOCK TABLES `tb_mall_goods_info` WRITE;
/*!40000 ALTER TABLE `tb_mall_goods_info` DISABLE KEYS */;
INSERT INTO `tb_mall_goods_info` VALUES (10003,'无印良品 MUJI 基础润肤化妆水','滋润型 400ml',0,'/goods-img/87446ec4-e534-4b49-9f7d-9bea34665284.jpg','/goods-img/87446ec4-e534-4b49-9f7d-9bea34665284.jpg','商品介绍加载中...',100,100,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10004,'无印良品 MUJI 柔和洁面泡沫','120g',0,'/goods-img/45854bdd-2ca5-423c-a609-3d336d9322b4.jpg','/goods-img/45854bdd-2ca5-423c-a609-3d336d9322b4.jpg','商品介绍加载中...',45,45,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10005,'无印良品 MUJI 基础润肤乳液','高保湿型 200ml',0,'/goods-img/7614ce78-0ebc-4275-a7cc-d16ad5f5f6ed.jpg','/goods-img/7614ce78-0ebc-4275-a7cc-d16ad5f5f6ed.jpg','商品介绍加载中...',83,83,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10006,'无印良品 MUJI 基础润肤乳液','滋润型 400ml',0,'/goods-img/ef75879d-3d3e-4bab-888d-1e4036491e11.jpg','/goods-img/ef75879d-3d3e-4bab-888d-1e4036491e11.jpg','商品介绍加载中...',100,100,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10007,'无印良品 MUJI 基础润肤化妆水','高保湿型 400ml',0,'/goods-img/558422d1-640e-442d-a073-2b2bdd95c4ed.jpg','/goods-img/558422d1-640e-442d-a073-2b2bdd95c4ed.jpg','商品介绍加载中...',127,127,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10008,'无印良品 MUJI 基础润肤化妆水','清爽型 200ml',0,'/goods-img/89660409-78b7-4d47-ae12-f94b3ce9664b.png','/goods-img/89660409-78b7-4d47-ae12-f94b3ce9664b.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10009,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 海军蓝 L',0,'/goods-img/f172c500-21d0-42e3-95ce-aa9b84a2ef49.jpg','/goods-img/f172c500-21d0-42e3-95ce-aa9b84a2ef49.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10010,'无印良品 MUJI 基础润肤洁面泡沫','200ml',0,'/goods-img/f87bdee1-ed48-4b49-b701-cc44f26a2699.jpg','/goods-img/f87bdee1-ed48-4b49-b701-cc44f26a2699.jpg','商品介绍加载中...',83,83,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10011,'无印良品 MUJI 平衡高保湿化妆水','新蜂精选',0,'/goods-img/16230038-bf86-4d4e-a11f-954b9ee4bab2.jpg','/goods-img/16230038-bf86-4d4e-a11f-954b9ee4bab2.jpg','商品介绍加载中...',130,65,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10012,'无印良品 MUJI 凝胶墨水圆珠笔','蓝黑色',0,'/goods-img/a952ecce-32e7-474e-9c1b-943962e0a580.jpg','/goods-img/a952ecce-32e7-474e-9c1b-943962e0a580.jpg','商品介绍加载中...',8,5,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10013,'无印良品 MUJI 平衡保湿乳霜','50g',0,'/goods-img/904c8aa1-0257-49e8-ad89-f48d2462db21.jpg','/goods-img/904c8aa1-0257-49e8-ad89-f48d2462db21.jpg','商品介绍加载中...',130,65,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10014,'无印良品 MUJI 基础润肤乳液','清爽型 200ml',0,'/goods-img/d66b6e0e-48d4-4503-8dd6-43b3c71f52a4.png','/goods-img/d66b6e0e-48d4-4503-8dd6-43b3c71f52a4.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10015,'无印良品 MUJI 平衡洁面泡沫','100g',0,'/goods-img/d0d8f6d1-1f2d-49f8-9099-0cdd94833581.jpg','/goods-img/d0d8f6d1-1f2d-49f8-9099-0cdd94833581.jpg','商品介绍加载中...',85,42,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10016,'无印良品 MUJI 基础润肤乳液','滋润型 200ml',0,'/goods-img/e553f566-5dc4-4648-be58-fd7112a47b10.jpg','/goods-img/e553f566-5dc4-4648-be58-fd7112a47b10.jpg','商品介绍加载中...',61,61,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10017,'无印良品 MUJI 便携式香薰机','新蜂精选',0,'/goods-img/a9c0d929-6f0b-4bc7-819c-e5015f447a9e.jpg','/goods-img/a9c0d929-6f0b-4bc7-819c-e5015f447a9e.jpg','商品介绍加载中...',200,200,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10018,'无印良品 MUJI 女式','粗棉线条纹长袖T恤 白色*横条 L',0,'/goods-img/38d5f694-2236-415d-80c8-4a1695e92d4e.jpg','/goods-img/38d5f694-2236-415d-80c8-4a1695e92d4e.jpg','商品介绍加载中...',198,70,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10019,'无印良品（MUJI） 聚丙烯化妆盒 1/2','半透明约150x220x86mm',0,'/goods-img/f6832ed7-cb01-48ab-987f-cd437b21be80.jpg','/goods-img/f6832ed7-cb01-48ab-987f-cd437b21be80.jpg','商品介绍加载中...',30,30,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10020,'无印良品 MUJI 聚丙烯','笔盒 大/约184*64*25㎜',0,'/goods-img/6c7f7a0d-4d73-406e-adcc-6f666ce4e2c9.jpg','/goods-img/6c7f7a0d-4d73-406e-adcc-6f666ce4e2c9.jpg','商品介绍加载中...',18,18,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10021,'无印良品（MUJI） 无针订书机 其他','新蜂精选',0,'/goods-img/cf19de8b-e94e-4513-aecd-a0b5c976b738.jpg','/goods-img/cf19de8b-e94e-4513-aecd-a0b5c976b738.jpg','商品介绍加载中...',52,52,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10022,'无印良品 MUJI 塑料橡皮','黑色 小',0,'/goods-img/d4f3299d-d526-4a81-ae9f-3b53e735075e.jpg','/goods-img/d4f3299d-d526-4a81-ae9f-3b53e735075e.jpg','商品介绍加载中...',4,4,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10023,'无印良品 MUJI 大容量基础乳液/高保湿型','400ml',0,'/goods-img/ea92b50a-67ba-4279-a71a-4e52e6a3219c.jpg','/goods-img/ea92b50a-67ba-4279-a71a-4e52e6a3219c.jpg','商品介绍加载中...',140,140,1000,'',0,0,'2019-09-18 13:18:47',0,'2019-09-18 13:18:47'),(10024,'无印良品 MUJI 基础润肤化妆水','滋润型 400ml',0,'/goods-img/beb26b1b-7a73-48c2-a9f7-727ad92401f6.jpg','/goods-img/beb26b1b-7a73-48c2-a9f7-727ad92401f6.jpg','商品介绍加载中...',100,100,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10025,'无印良品 MUJI 柔和洁面泡沫','120g',0,'/goods-img/bf1dc4d1-acc2-40c8-8091-1c6f35988643.jpg','/goods-img/bf1dc4d1-acc2-40c8-8091-1c6f35988643.jpg','商品介绍加载中...',45,45,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10026,'无印良品 MUJI 基础润肤乳液','高保湿型 200ml',0,'/goods-img/4059caa9-e0b3-4ac3-a494-b9e4c47e0185.jpg','/goods-img/4059caa9-e0b3-4ac3-a494-b9e4c47e0185.jpg','商品介绍加载中...',83,83,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10027,'无印良品 MUJI 基础润肤乳液','滋润型 400ml',0,'/goods-img/a4a4c981-da0f-4228-bcc7-97d970dc619c.jpg','/goods-img/a4a4c981-da0f-4228-bcc7-97d970dc619c.jpg','商品介绍加载中...',100,100,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10028,'无印良品 MUJI 基础润肤化妆水','高保湿型 400ml',0,'/goods-img/98b5c5b5-cc75-4dfb-8ec4-0a7f42af6183.jpg','/goods-img/98b5c5b5-cc75-4dfb-8ec4-0a7f42af6183.jpg','商品介绍加载中...',127,127,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10029,'无印良品 MUJI 基础润肤化妆水','清爽型 200ml',0,'/goods-img/71d1f469-b77b-473a-a31a-78fc97859b3a.png','/goods-img/71d1f469-b77b-473a-a31a-78fc97859b3a.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10030,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 海军蓝 L',0,'/goods-img/68bfbfd9-bc28-429a-ab2c-7fa62205ed7e.jpg','/goods-img/68bfbfd9-bc28-429a-ab2c-7fa62205ed7e.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10031,'无印良品 MUJI 基础润肤洁面泡沫','200ml',0,'/goods-img/679eb5a8-7689-4620-b072-63daeb8eb73a.jpg','/goods-img/679eb5a8-7689-4620-b072-63daeb8eb73a.jpg','商品介绍加载中...',83,83,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10032,'无印良品 MUJI 平衡高保湿化妆水','新蜂精选',0,'/goods-img/eb13afc6-8898-4a50-9f93-06dd2593c313.jpg','/goods-img/eb13afc6-8898-4a50-9f93-06dd2593c313.jpg','商品介绍加载中...',130,65,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10033,'无印良品 MUJI 凝胶墨水圆珠笔','蓝黑色',0,'/goods-img/85a893fe-c971-4f0b-aa0f-4c24b65b1c75.jpg','/goods-img/85a893fe-c971-4f0b-aa0f-4c24b65b1c75.jpg','商品介绍加载中...',8,5,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10034,'无印良品 MUJI 平衡保湿乳霜','50g',0,'/goods-img/65aed381-cde0-44ed-b345-5ebf1d74a13b.jpg','/goods-img/65aed381-cde0-44ed-b345-5ebf1d74a13b.jpg','商品介绍加载中...',130,65,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10035,'无印良品 MUJI 基础润肤乳液','清爽型 200ml',0,'/goods-img/1e09e1ed-435b-4f08-84d0-d88308a315ee.png','/goods-img/1e09e1ed-435b-4f08-84d0-d88308a315ee.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10036,'无印良品 MUJI 平衡洁面泡沫','100g',0,'/goods-img/dbc2ea2a-ee03-4366-a35e-6ebe66d02399.jpg','/goods-img/dbc2ea2a-ee03-4366-a35e-6ebe66d02399.jpg','商品介绍加载中...',85,42,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10037,'无印良品 MUJI 基础润肤乳液','滋润型 200ml',0,'/goods-img/9389914c-2860-4a75-b603-53ed5a4e0509.jpg','/goods-img/9389914c-2860-4a75-b603-53ed5a4e0509.jpg','商品介绍加载中...',61,61,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10038,'无印良品 MUJI 便携式香薰机','新蜂精选',0,'/goods-img/6ab010e2-5f1e-4512-bd22-4c2550915d4c.jpg','/goods-img/6ab010e2-5f1e-4512-bd22-4c2550915d4c.jpg','商品介绍加载中...',200,200,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10039,'无印良品 MUJI 女式','粗棉线条纹长袖T恤 白色*横条 L',0,'/goods-img/fab00903-7ff6-40ee-a9bc-3fbc2f0f0ffc.jpg','/goods-img/fab00903-7ff6-40ee-a9bc-3fbc2f0f0ffc.jpg','商品介绍加载中...',198,70,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10040,'无印良品（MUJI） 聚丙烯化妆盒 1/2','半透明约150x220x86mm',0,'/goods-img/ab725751-adb8-452a-86dd-cb3d21da794e.jpg','/goods-img/ab725751-adb8-452a-86dd-cb3d21da794e.jpg','商品介绍加载中...',30,30,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10041,'无印良品 MUJI 聚丙烯','笔盒 大/约184*64*25㎜',0,'/goods-img/9f623290-928c-498f-89e6-171372b394f2.jpg','/goods-img/9f623290-928c-498f-89e6-171372b394f2.jpg','商品介绍加载中...',18,18,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10042,'无印良品（MUJI） 无针订书机 其他','新蜂精选',0,'/goods-img/a7221688-3c37-4ac0-b07e-d8bde1525d1e.jpg','/goods-img/a7221688-3c37-4ac0-b07e-d8bde1525d1e.jpg','商品介绍加载中...',52,52,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10043,'无印良品 MUJI 塑料橡皮','黑色 小',0,'/goods-img/75e26af4-8f15-43f2-9407-50d641f82acb.jpg','/goods-img/75e26af4-8f15-43f2-9407-50d641f82acb.jpg','商品介绍加载中...',4,4,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10044,'无印良品 MUJI 大容量基础乳液/高保湿型','400ml',0,'/goods-img/69d55773-1b43-497b-af18-90f2cec7c93a.jpg','/goods-img/69d55773-1b43-497b-af18-90f2cec7c93a.jpg','商品介绍加载中...',140,140,1000,'',0,0,'2019-09-18 13:18:52',0,'2019-09-18 13:18:52'),(10045,'无印良品 MUJI 毛笔','黑色',0,'/goods-img/419ddb3c-1793-49c1-8953-77409a5d5bce.jpg','/goods-img/419ddb3c-1793-49c1-8953-77409a5d5bce.jpg','商品介绍加载中...',20,20,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10046,'无印良品 MUJI 塑料橡皮','白色 小',0,'/goods-img/e53cc7af-f81c-4752-aec8-007e807b2fc1.jpg','/goods-img/e53cc7af-f81c-4752-aec8-007e807b2fc1.jpg','商品介绍加载中...',4,4,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10047,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 深海军蓝X格子 L',0,'/goods-img/481e8994-20cb-4f6c-8b77-4eb8509eb3b9.jpg','/goods-img/481e8994-20cb-4f6c-8b77-4eb8509eb3b9.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10048,'无印良品 MUJI 荧光笔','蓝色',0,'/goods-img/012ebf2d-8c96-4641-8782-eab01c85d98f.jpg','/goods-img/012ebf2d-8c96-4641-8782-eab01c85d98f.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10049,'无印良品（MUJI） 钢制指甲刀 小','新蜂精选',0,'/goods-img/2c150720-4b3a-4d9e-9ce6-77eb4998e1f1.jpg','/goods-img/2c150720-4b3a-4d9e-9ce6-77eb4998e1f1.jpg','商品介绍加载中...',42,42,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10050,'无印良品 MUJI 长条诗笺型笔记表格','白色 40枚 14行',0,'/goods-img/e7d2ea3f-6703-4fcc-bbb4-ad9ef43a0ae2.jpg','/goods-img/e7d2ea3f-6703-4fcc-bbb4-ad9ef43a0ae2.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10051,'无印良品 MUJI PET喷雾小分装瓶100ml','新蜂精选',0,'/goods-img/0ec8c4a7-aedc-464d-9e23-d3e4acafdc73.jpg','/goods-img/0ec8c4a7-aedc-464d-9e23-d3e4acafdc73.jpg','商品介绍加载中...',30,30,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10052,'无印良品 MUJI 塑料橡皮','黑色 大',0,'/goods-img/ce8ff43c-e8b4-4c52-9de1-c983c97068f6.jpg','/goods-img/ce8ff43c-e8b4-4c52-9de1-c983c97068f6.jpg','商品介绍加载中...',7,7,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10053,'无印良品 MUJI 荧光笔','黄色',0,'/goods-img/79b38a89-b02a-4fd1-80c4-5cb426028536.jpg','/goods-img/79b38a89-b02a-4fd1-80c4-5cb426028536.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10054,'无印良品 MUJI 遮瑕膏','棒状 自然色',0,'/goods-img/ffa69c8e-f57f-4ef4-a2a0-3695d538d6c5.jpg','/goods-img/ffa69c8e-f57f-4ef4-a2a0-3695d538d6c5.jpg','商品介绍加载中...',42,42,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10055,'无印良品 MUJI 马桶刷/附盒子','白色',0,'/goods-img/9dd1cdfb-e7f9-4d3c-98df-933e2bc3f9a8.jpg','/goods-img/9dd1cdfb-e7f9-4d3c-98df-933e2bc3f9a8.jpg','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10056,'无印良品 MUJI 耐热玻璃_壶_大','透明',0,'/goods-img/0bc4f5ac-d601-421d-8131-81958a195705.jpg','/goods-img/0bc4f5ac-d601-421d-8131-81958a195705.jpg','商品介绍加载中...',150,150,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10057,'无印良品 MUJI 女式','平纹短袖衬衫 藏青色 M',0,'/goods-img/76b6a573-12a0-4c63-b2ae-e7193aff0fc8.jpg','/goods-img/76b6a573-12a0-4c63-b2ae-e7193aff0fc8.jpg','商品介绍加载中...',198,59,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10058,'无印良品 MUJI 基础润肤化妆水','清爽型 50ml',0,'/goods-img/af7f9b21-d782-4bad-8b1a-d86bbc4d224e.png','/goods-img/af7f9b21-d782-4bad-8b1a-d86bbc4d224e.png','商品介绍加载中...',28,22,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10059,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 炭灰色 M',0,'/goods-img/26e0c424-f22d-4d3d-9bd6-a7958a346ff9.jpg','/goods-img/26e0c424-f22d-4d3d-9bd6-a7958a346ff9.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10060,'无印良品（MUJI） PET分裝瓶','新蜂精选',0,'/goods-img/24bf1630-0339-4c22-ad19-37152c561e71.jpg','/goods-img/24bf1630-0339-4c22-ad19-37152c561e71.jpg','商品介绍加载中...',15,15,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10061,'无印良品 MUJI 女式','无侧缝法兰绒 睡衣 灰色 M',0,'/goods-img/e8e26306-0521-4843-9e07-70ebd2fa6405.jpg','/goods-img/e8e26306-0521-4843-9e07-70ebd2fa6405.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10062,'无印良品（MUJI） PE分裝瓶','新蜂精选',0,'/goods-img/9b3af7c2-57f5-48a7-bea5-603b2d145000.jpg','/goods-img/9b3af7c2-57f5-48a7-bea5-603b2d145000.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10063,'无印良品 MUJI 基础润肤化妆水','滋润型 200ml',0,'/goods-img/7577f3e0-f48b-47a9-96b7-de405a6aaf95.png','/goods-img/7577f3e0-f48b-47a9-96b7-de405a6aaf95.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10064,'无印良品 MUJI 男式','干爽 凉感珠地网眼编织V领短袖T恤 黑色 L',0,'/goods-img/cce2af31-07ea-4744-8d01-16dd01d68e5b.jpg','/goods-img/cce2af31-07ea-4744-8d01-16dd01d68e5b.jpg','商品介绍加载中...',98,29,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10065,'无印良品（MUJI） 聚丙烯化妆盒 半透明约150x220x169mm','新蜂精选',0,'/goods-img/6dc279ac-fef0-401c-8604-b18dc9a9f7ab.jpg','/goods-img/6dc279ac-fef0-401c-8604-b18dc9a9f7ab.jpg','商品介绍加载中...',40,40,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10066,'无印良品（MUJI） 散粉小 自然色','新蜂精选',0,'/goods-img/94764fac-f4ad-4ee8-8d26-21af0c09ea76.jpg','/goods-img/94764fac-f4ad-4ee8-8d26-21af0c09ea76.jpg','商品介绍加载中...',60,60,1000,'',0,0,'2019-09-18 13:19:02',0,'2019-09-18 13:19:02'),(10067,'无印良品 MUJI 毛笔','黑色',0,'/goods-img/9cd07460-8c0b-49e5-9741-5015a3576e8e.jpg','/goods-img/9cd07460-8c0b-49e5-9741-5015a3576e8e.jpg','商品介绍加载中...',20,20,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10068,'无印良品 MUJI 塑料橡皮','白色 小',0,'/goods-img/70529ced-527a-4b46-aafa-874107ff9ea5.jpg','/goods-img/70529ced-527a-4b46-aafa-874107ff9ea5.jpg','商品介绍加载中...',4,4,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10069,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 深海军蓝X格子 L',0,'/goods-img/174ec60d-7d2b-4043-a7a6-7383c3de1a11.jpg','/goods-img/174ec60d-7d2b-4043-a7a6-7383c3de1a11.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10070,'无印良品 MUJI 荧光笔','蓝色',0,'/goods-img/eef29d44-17f5-41dd-b0ba-c6f63d7bdac3.jpg','/goods-img/eef29d44-17f5-41dd-b0ba-c6f63d7bdac3.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10071,'无印良品（MUJI） 钢制指甲刀 小','新蜂精选',0,'/goods-img/f9964432-a9b7-45c2-ac6d-680130c2d7a7.jpg','/goods-img/f9964432-a9b7-45c2-ac6d-680130c2d7a7.jpg','商品介绍加载中...',42,42,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10072,'无印良品 MUJI 长条诗笺型笔记表格','白色 40枚 14行',0,'/goods-img/da1e4523-adb4-48e4-afa5-313346187690.jpg','/goods-img/da1e4523-adb4-48e4-afa5-313346187690.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10073,'无印良品 MUJI PET喷雾小分装瓶100ml','新蜂精选',0,'/goods-img/7f1eec3d-d8e5-4a18-a1a9-b81876dcaaf5.jpg','/goods-img/7f1eec3d-d8e5-4a18-a1a9-b81876dcaaf5.jpg','商品介绍加载中...',30,30,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10074,'无印良品 MUJI 塑料橡皮','黑色 大',0,'/goods-img/1ca16211-2b80-4006-ab60-e1a3cab4218c.jpg','/goods-img/1ca16211-2b80-4006-ab60-e1a3cab4218c.jpg','商品介绍加载中...',7,7,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10075,'无印良品 MUJI 荧光笔','黄色',0,'/goods-img/56eec806-2af3-4136-a9bf-2333455339e7.jpg','/goods-img/56eec806-2af3-4136-a9bf-2333455339e7.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10076,'无印良品 MUJI 遮瑕膏','棒状 自然色',0,'/goods-img/593b65a7-feae-45aa-837e-47d58bb27474.jpg','/goods-img/593b65a7-feae-45aa-837e-47d58bb27474.jpg','商品介绍加载中...',42,42,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10077,'无印良品 MUJI 马桶刷/附盒子','白色',0,'/goods-img/a9983f71-d818-459d-ad59-bbdd26bb533b.jpg','/goods-img/a9983f71-d818-459d-ad59-bbdd26bb533b.jpg','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10078,'无印良品 MUJI 耐热玻璃_壶_大','透明',0,'/goods-img/7f89c29e-d888-4ee0-92af-ca713a7871a4.jpg','/goods-img/7f89c29e-d888-4ee0-92af-ca713a7871a4.jpg','商品介绍加载中...',150,150,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10079,'无印良品 MUJI 女式','平纹短袖衬衫 藏青色 M',0,'/goods-img/0b1e57bf-b4fd-40df-9832-4749d7d69db9.jpg','/goods-img/0b1e57bf-b4fd-40df-9832-4749d7d69db9.jpg','商品介绍加载中...',198,59,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10080,'无印良品 MUJI 基础润肤化妆水','清爽型 50ml',0,'/goods-img/9b4af7cf-235a-4742-bdc3-9e8e656f245c.png','/goods-img/9b4af7cf-235a-4742-bdc3-9e8e656f245c.png','商品介绍加载中...',28,22,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10081,'无印良品 MUJI 男式','无侧缝法兰绒 睡衣 炭灰色 M',0,'/goods-img/8ddfc2de-3da3-4fad-86aa-7c570cb55212.jpg','/goods-img/8ddfc2de-3da3-4fad-86aa-7c570cb55212.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10082,'无印良品（MUJI） PET分裝瓶','新蜂精选',0,'/goods-img/e62d04e9-3ae2-431c-8538-becda89e0e84.jpg','/goods-img/e62d04e9-3ae2-431c-8538-becda89e0e84.jpg','商品介绍加载中...',15,15,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10083,'无印良品 MUJI 女式','无侧缝法兰绒 睡衣 灰色 M',0,'/goods-img/3078143f-1cdd-4f66-951b-2cf08af8c826.jpg','/goods-img/3078143f-1cdd-4f66-951b-2cf08af8c826.jpg','商品介绍加载中...',398,199,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10084,'无印良品（MUJI） PE分裝瓶','新蜂精选',0,'/goods-img/97aa8872-26df-473a-b0d7-f5021776cb52.jpg','/goods-img/97aa8872-26df-473a-b0d7-f5021776cb52.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10085,'无印良品 MUJI 基础润肤化妆水','滋润型 200ml',0,'/goods-img/954da201-0cbb-45d1-9cd1-17ce4d24cfb4.png','/goods-img/954da201-0cbb-45d1-9cd1-17ce4d24cfb4.png','商品介绍加载中...',70,70,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10086,'无印良品 MUJI 男式','干爽 凉感珠地网眼编织V领短袖T恤 黑色 L',0,'/goods-img/b584ea09-7aae-422e-8435-fdc38c948434.jpg','/goods-img/b584ea09-7aae-422e-8435-fdc38c948434.jpg','商品介绍加载中...',98,29,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10087,'无印良品（MUJI） 聚丙烯化妆盒 半透明约150x220x169mm','新蜂精选',0,'/goods-img/a0a45b44-82c9-4a58-a972-304bed0632bb.jpg','/goods-img/a0a45b44-82c9-4a58-a972-304bed0632bb.jpg','商品介绍加载中...',40,40,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10088,'无印良品（MUJI） 散粉小 自然色','新蜂精选',0,'/goods-img/a1b8ff33-ec01-494e-a1db-fb5158f3c168.jpg','/goods-img/a1b8ff33-ec01-494e-a1db-fb5158f3c168.jpg','商品介绍加载中...',60,60,1000,'',0,0,'2019-09-18 13:19:07',0,'2019-09-18 13:19:07'),(10089,'无印良品 MUJI 荧光笔','粉红色',0,'/goods-img/c5d6d952-c81b-436a-a345-feb4c5a20a7d.jpg','/goods-img/c5d6d952-c81b-436a-a345-feb4c5a20a7d.jpg','商品介绍加载中...',10,10,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10090,'无印良品（MUJI） PET小分装瓶100ml','新蜂精选',0,'/goods-img/2ffe59f3-559f-4e6f-810d-1b6fa4ac04e1.jpg','/goods-img/2ffe59f3-559f-4e6f-810d-1b6fa4ac04e1.jpg','商品介绍加载中...',30,30,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10091,'无印良品 MUJI 基础润肤洁面乳','150ml',0,'/goods-img/1f24d75a-0468-471a-a608-bd6788f4c1a1.jpg','/goods-img/1f24d75a-0468-471a-a608-bd6788f4c1a1.jpg','商品介绍加载中...',74,74,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10092,'无印良品 MUJI 基础润肤乳霜','其他 50g',0,'/goods-img/86e027b3-8868-4fa5-971b-49e827027e3e.jpg','/goods-img/86e027b3-8868-4fa5-971b-49e827027e3e.jpg','商品介绍加载中...',100,100,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10093,'无印良品 MUJI 基础润肤洁面泡沫(替换装)','180ml',0,'/goods-img/1aea34fa-f45e-4c3c-b73c-da1f92492c95.jpg','/goods-img/1aea34fa-f45e-4c3c-b73c-da1f92492c95.jpg','商品介绍加载中...',69,69,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10094,'无印良品 MUJI 保湿洁面啫喱','100g',0,'/goods-img/838fc0cb-b98f-4dca-bd68-581138b21a30.jpg','/goods-img/838fc0cb-b98f-4dca-bd68-581138b21a30.jpg','商品介绍加载中...',100,50,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10095,'无印良品 MUJI 小型超声波香薰机','其他',0,'/goods-img/30f05c92-a303-4b94-bb5e-22f3c65f3c37.jpg','/goods-img/30f05c92-a303-4b94-bb5e-22f3c65f3c37.jpg','商品介绍加载中...',250,250,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10096,'无印良品 MUJI 修正带','其他',0,'/goods-img/759427b3-b723-4917-b565-c0ae2003bf02.jpg','/goods-img/759427b3-b723-4917-b565-c0ae2003bf02.jpg','商品介绍加载中...',25,25,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10097,'无印良品 MUJI 聚丙烯','笔盒 小/约170*51*20㎜',0,'/goods-img/734f1604-e687-4cd1-8573-bb00e680e94e.jpg','/goods-img/734f1604-e687-4cd1-8573-bb00e680e94e.jpg','商品介绍加载中...',12,12,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10098,'无印良品 MUJI 乳液','50ml',0,'/goods-img/4eed1033-7728-477c-a29d-589bfd3ae3ce.jpg','/goods-img/4eed1033-7728-477c-a29d-589bfd3ae3ce.jpg','商品介绍加载中...',55,27,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10099,'无印良品 MUJI 男式','棉水洗 平纹短袖衬衫 白色 L',0,'/goods-img/d3fa11f3-6cfa-4958-b09c-584a62137b4b.jpg','/goods-img/d3fa11f3-6cfa-4958-b09c-584a62137b4b.jpg','商品介绍加载中...',178,89,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10100,'无印良品 MUJI 香/绿意','12支装/棒状',0,'/goods-img/829f2d09-1589-4f63-8376-d347c3cec620.jpg','/goods-img/829f2d09-1589-4f63-8376-d347c3cec620.jpg','商品介绍加载中...',32,32,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10101,'无印良品 MUJI 润肤乳霜(高保湿型)50g','50g',0,'/goods-img/1c70ddcb-ca69-40ed-a263-30880b2e2cac.jpg','/goods-img/1c70ddcb-ca69-40ed-a263-30880b2e2cac.jpg','商品介绍加载中...',159,159,999,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10102,'无印良品 MUJI 柔滑笔芯','黑色',0,'/goods-img/1db10d7c-3429-4ef2-ac41-2991af57f442.jpg','/goods-img/1db10d7c-3429-4ef2-ac41-2991af57f442.jpg','商品介绍加载中...',19,19,999,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10103,'无印良品 MUJI 铝制','挂钩/吸盘式_2个装 大/约宽4.5x高6cm 2个装',0,'/goods-img/bd0b92b4-c8ca-453a-b572-b3447083bddf.png','/goods-img/bd0b92b4-c8ca-453a-b572-b3447083bddf.png','商品介绍加载中...',25,25,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10104,'无印良品 MUJI 修正带','POM材质 替芯',0,'/goods-img/98ce17e1-890e-4eaf-856a-7fce8ffebc4c.jpg','/goods-img/98ce17e1-890e-4eaf-856a-7fce8ffebc4c.jpg','商品介绍加载中...',15,15,999,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10105,'无印良品 MUJI 压克力记录板夹','Ａ4用/220×310ｍｍ',0,'/goods-img/64d4e0b7-cd01-47f6-9081-4c2e7625e4f9.jpg','/goods-img/64d4e0b7-cd01-47f6-9081-4c2e7625e4f9.jpg','商品介绍加载中...',35,35,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10106,'无印良品（MUJI） 自然亲肤粉底液 自然透亮色','新蜂精选',0,'/goods-img/09576fcd-ea01-4b1d-bed4-be96b71f2c4e.jpg','/goods-img/09576fcd-ea01-4b1d-bed4-be96b71f2c4e.jpg','商品介绍加载中...',75,75,1000,'',0,0,'2019-09-18 13:19:17',0,'2019-09-18 13:19:17'),(10107,'无印良品 MUJI 荧光笔','粉红色',0,'/goods-img/04a8c325-d296-4f0e-ac6d-8cccba4dc90e.jpg','/goods-img/04a8c325-d296-4f0e-ac6d-8cccba4dc90e.jpg','商品介绍加载中...',10,10,999,'',0,0,'2019-09-18 13:19:22',0,'2019-09-18 13:19:22'),(10108,'无印良品（MUJI） PET小分装瓶100ml','新蜂精选',0,'/goods-img/755a34a3-bc3e-4f04-8943-f79860012e78.jpg','/goods-img/755a34a3-bc3e-4f04-8943-f79860012e78.jpg','商品介绍加载中...',30,30,999,'',0,0,'2019-09-18 13:19:22',0,'2019-09-18 13:19:22');
/*!40000 ALTER TABLE `tb_mall_goods_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_index_config`
--

DROP TABLE IF EXISTS `tb_mall_index_config`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_index_config` (
  `config_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '首页配置项主键id',
  `config_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '显示字符(配置搜索时不可为空，其他可为空)',
  `config_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1-搜索框热搜 2-搜索下拉框热搜 3-(首页)热销商品 4-(首页)新品上线 5-(首页)为你推荐',
  `goods_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '商品id 默认为0',
  `redirect_url` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '##' COMMENT '点击后的跳转地址(默认不跳转)',
  `config_rank` int(11) NOT NULL DEFAULT '0' COMMENT '排序值(字段越大越靠前)',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `create_user` int(11) NOT NULL DEFAULT '0' COMMENT '创建者id',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '最新修改时间',
  `update_user` int(11) DEFAULT '0' COMMENT '修改者id',
  PRIMARY KEY (`config_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_index_config`
--

LOCK TABLES `tb_mall_index_config` WRITE;
/*!40000 ALTER TABLE `tb_mall_index_config` DISABLE KEYS */;
INSERT INTO `tb_mall_index_config` VALUES (1,'热销商品 iPhone XR',3,10284,'##',10,0,'2019-09-18 17:04:56',0,'2019-09-18 17:04:56',0),(2,'热销商品 华为 Mate20',3,10779,'##',100,0,'2019-09-18 17:05:27',0,'2019-09-18 17:05:27',0),(3,'热销商品 荣耀8X',3,10700,'##',300,0,'2019-09-18 17:08:02',0,'2019-09-18 17:08:02',0),(4,'热销商品 Apple AirPods',3,10159,'##',101,0,'2019-09-18 17:08:56',0,'2019-09-18 17:08:56',0),(5,'新品上线 Macbook Pro',4,10269,'##',100,0,'2019-09-18 17:10:36',0,'2019-09-18 17:10:36',0),(6,'新品上线 荣耀 9X Pro',4,10755,'##',100,0,'2019-09-18 17:11:05',0,'2019-09-18 17:11:05',0),(7,'新品上线 iPhone 11',4,10283,'##',102,0,'2019-09-18 17:11:44',0,'2019-09-18 17:11:44',0),(8,'新品上线 iPhone 11 Pro',4,10320,'##',101,0,'2019-09-18 17:11:58',0,'2019-09-18 17:11:58',0),(9,'新品上线 华为无线耳机',4,10186,'##',100,0,'2019-09-18 17:12:29',0,'2019-09-18 17:12:29',0),(10,'纪梵希高定香榭天鹅绒唇膏',5,10233,'##',98,0,'2019-09-18 17:47:23',0,'2019-09-18 17:47:23',0),(11,'MAC 磨砂系列',5,10237,'##',100,0,'2019-09-18 17:47:44',0,'2019-09-18 17:47:44',0),(12,'索尼 WH-1000XM3',5,10195,'##',102,0,'2019-09-18 17:48:00',0,'2019-09-18 17:48:00',0),(13,'Apple AirPods',5,10180,'##',101,0,'2019-09-18 17:49:11',0,'2019-09-18 17:49:11',0),(14,'小米 Redmi AirDots',5,10160,'##',100,0,'2019-09-18 17:49:28',0,'2019-09-18 17:49:28',0),(15,'2019 MacBookAir 13',5,10254,'##',100,0,'2019-09-18 17:50:18',0,'2019-09-18 17:50:18',0),(16,'长袖T恤',5,10158,'##',95,0,'2019-09-18 17:52:03',0,'2019-09-18 17:52:03',0),(17,'塑料浴室座椅',5,10154,'##',100,0,'2019-09-18 17:52:19',0,'2019-09-18 17:52:19',0),(18,'靠垫',5,10147,'##',101,0,'2019-09-18 17:52:50',0,'2019-09-18 17:52:50',0),(19,'小型超声波香薰机',5,10113,'##',100,0,'2019-09-18 17:54:07',0,'2019-09-18 17:54:07',0),(20,'11',5,1,'##',0,1,'2019-09-19 08:31:11',0,'2019-09-19 08:31:20',0),(21,'热销商品 华为 P30',3,10742,'##',200,0,'2019-09-19 23:23:38',0,'2019-09-19 23:23:38',0),(22,'新品上线 华为Mate30 Pro',4,10893,'##',200,0,'2019-09-19 23:26:05',0,'2019-09-19 23:26:05',0),(23,'新品上线 华为 Mate 30',4,10895,'##',199,0,'2019-09-19 23:26:32',0,'2019-09-19 23:26:32',0),(24,'华为 Mate 30 Pro',5,10894,'##',101,0,'2019-09-19 23:27:00',0,'2019-09-19 23:27:00',0);
/*!40000 ALTER TABLE `tb_mall_index_config` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_order`
--

DROP TABLE IF EXISTS `tb_mall_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_order` (
  `order_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '订单表主键id',
  `order_no` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '订单号',
  `user_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '用户主键id',
  `total_price` int(11) NOT NULL DEFAULT '1' COMMENT '订单总价',
  `pay_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '支付状态:0.未支付,1.支付成功,-1:支付失败',
  `pay_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0.无 1.支付宝支付 2.微信支付',
  `pay_time` datetime DEFAULT NULL COMMENT '支付时间',
  `order_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '订单状态:0.待支付 1.已支付 2.配货完成 3:出库成功 4.交易成功 -1.手动关闭 -2.超时关闭 -3.商家关闭',
  `extra_info` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '订单body',
  `user_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人姓名',
  `user_phone` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人手机号',
  `user_address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人收货地址',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '最新修改时间',
  PRIMARY KEY (`order_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_order`
--

LOCK TABLES `tb_mall_order` WRITE;
/*!40000 ALTER TABLE `tb_mall_order` DISABLE KEYS */;
INSERT INTO `tb_mall_order` VALUES (9,'15859724046077936',0,30,1,1,'2020-04-04 11:53:32',4,'','','','上海市嘉定区xx路xx号',0,'2020-04-04 11:53:24','2020-04-04 11:54:52'),(10,'15859729124802575',9,159,1,1,'2020-04-04 12:01:58',4,'','','','上海市嘉定区xx路xx号',0,'2020-04-04 12:01:52','2020-04-04 12:03:15'),(11,'15859730048018787',9,19,1,1,'2020-04-04 12:03:31',-1,'','','','上海市嘉定区xx路xx号',0,'2020-04-04 12:03:24','2020-04-04 12:03:33');
/*!40000 ALTER TABLE `tb_mall_order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_order_item`
--

DROP TABLE IF EXISTS `tb_mall_order_item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_order_item` (
  `order_item_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '订单关联购物项主键id',
  `order_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '订单主键id',
  `goods_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '关联商品id',
  `goods_name` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '下单时商品的名称(订单快照)',
  `goods_cover_img` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '下单时商品的主图(订单快照)',
  `selling_price` int(11) NOT NULL DEFAULT '1' COMMENT '下单时商品的价格(订单快照)',
  `goods_count` int(11) NOT NULL DEFAULT '1' COMMENT '数量(订单快照)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`order_item_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_order_item`
--

LOCK TABLES `tb_mall_order_item` WRITE;
/*!40000 ALTER TABLE `tb_mall_order_item` DISABLE KEYS */;
INSERT INTO `tb_mall_order_item` VALUES (20,9,10108,'无印良品（MUJI） PET小分装瓶100ml','/goods-img/755a34a3-bc3e-4f04-8943-f79860012e78.jpg',30,1,'2020-04-04 11:53:24'),(21,10,10101,'无印良品 MUJI 润肤乳霜(高保湿型)50g','/goods-img/1c70ddcb-ca69-40ed-a263-30880b2e2cac.jpg',159,1,'2020-04-04 12:01:52'),(22,11,10102,'无印良品 MUJI 柔滑笔芯','/goods-img/1db10d7c-3429-4ef2-ac41-2991af57f442.jpg',19,1,'2020-04-04 12:03:24');
/*!40000 ALTER TABLE `tb_mall_order_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_shopping_cart_item`
--

DROP TABLE IF EXISTS `tb_mall_shopping_cart_item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_shopping_cart_item` (
  `cart_item_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '购物项主键id',
  `user_id` bigint(20) NOT NULL COMMENT '用户主键id',
  `goods_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '关联商品id',
  `goods_count` int(11) NOT NULL DEFAULT '1' COMMENT '数量(最大为5)',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '最新修改时间',
  PRIMARY KEY (`cart_item_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_shopping_cart_item`
--

LOCK TABLES `tb_mall_shopping_cart_item` WRITE;
/*!40000 ALTER TABLE `tb_mall_shopping_cart_item` DISABLE KEYS */;
/*!40000 ALTER TABLE `tb_mall_shopping_cart_item` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tb_mall_user`
--

DROP TABLE IF EXISTS `tb_mall_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `tb_mall_user` (
  `user_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '用户主键id',
  `nick_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '用户昵称',
  `login_name` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '登陆名称(默认为手机号)',
  `password_md5` varchar(32) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT 'MD5加密后的密码',
  `introduce_sign` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '个性签名',
  `address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货地址',
  `is_deleted` tinyint(4) NOT NULL DEFAULT '0' COMMENT '注销标识字段(0-正常 1-已注销)',
  `locked_flag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '锁定标识字段(0-未锁定 1-已锁定)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '注册时间',
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tb_mall_user`
--

LOCK TABLES `tb_mall_user` WRITE;
/*!40000 ALTER TABLE `tb_mall_user` DISABLE KEYS */;
INSERT INTO `tb_mall_user` VALUES (9,'demo','18899098808','670b14728ad9902aecba32e22fa4f6bd','just do it','上海市嘉定区xx路xx号',0,0,'2020-04-02 12:26:59');
/*!40000 ALTER TABLE `tb_mall_user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-04-04 12:10:05
